[{"class":"HIST2112","date_posted":"2010-07-13 02:11:14 +0000 UTC","comment":"Well structured teacher. Organized and follows the syllabus almost to a T. May go through outline quick but there's a lot of information to take in. Be glad for the outline because he could just give you pages to read in the book and you never know whats going on People come in to class late a lot he should lock them out but doesnt he's nice IMO","difficulty_rating":3,"teacher_id":"UmF0aW5nLTE3NDEzNzM4","clarity_rating":4,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":4,"would_take_again":true},{"class":"HIST2112","date_posted":"2010-06-25 20:59:15 +0000 UTC","comment":"Doesn't use the textbook, just the book for readings. Very unclear of what to study for the tests. Reads straight off the notes but you have to fill in the bullets on his outline. Hard to pay attention while having to write very fast. Gets irritated VERY quickly. Very rude and military like. Avoid him unless you REALLY like History. Good luck!","difficulty_rating":4,"teacher_id":"UmF0aW5nLTE3MzY4ODYy","clarity_rating":1,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true},{"class":"SSED4413","date_posted":"2006-04-20 08:55:09 +0000 UTC","comment":"he was my supervising prof for TOSS. He was very unclear in his expectations and even contradicted himself many times. He would look at my portfolio and tell me ways to improve it and at the end of sem he says he never saw the portfolio. He made unprofessional comments about muslims in class that had muslims in it. Very militaristic in his demeanor","difficulty_rating":3,"teacher_id":"UmF0aW5nLTExNzM0NTE1","clarity_rating":1,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":null,"would_take_again":true}]