[{"class":"ENGL2130","date_posted":"2020-05-06 22:11:52 +0000 UTC","comment":"Professor is nice and very knowledgeable. Those are the only positives. She grades unnecessarily hard, and only grades you on a medium amount of assignments. It's mostly reading quizzes, two minor projects, and the closed note final. During this pandemic, she didn't do anything to accommodate for the move to online during COVID-19... :/","difficulty_rating":4,"teacher_id":"UmF0aW5nLTMzMjIzNDQ1","clarity_rating":2,"student_grade":"B","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Skip class? You won't pass.--Tough grader","textbook_use":5,"would_take_again":false},{"class":"ENGL2130","date_posted":"2020-05-05 10:26:07 +0000 UTC","comment":"Best part of this class is that there is very little writing involved. It's mainly reading the works that are discussed throughout the semester. Beyond a select few, all of the books, short stories and poetry are great. Not a hard class but you have to pay attention to the material. She's also a really nice person so that's always a plus.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTMzMjA1NDk0","clarity_rating":5,"student_grade":"Not sure yet","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Lots of homework--Get ready to read--Skip class? You won't pass.","textbook_use":0,"would_take_again":true},{"class":"ENG2130","date_posted":"2020-03-24 19:18:29 +0000 UTC","comment":"If you're ready to read every single night and memorize the author, title, and significance of the works then take her. This class is all reading and memorizing to understand American Literature. It is TOUGH. The final is overly difficult for only having 2 hours. (3 essays, 10 names/titles from memory and remembering the significance of the piece)","difficulty_rating":5,"teacher_id":"UmF0aW5nLTMyOTg5ODgx","clarity_rating":3,"student_grade":"A","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Lots of homework--Accessible outside class--Get ready to read","textbook_use":5,"would_take_again":false},{"class":"ENGL2130","date_posted":"2020-02-24 18:01:22 +0000 UTC","comment":"I had to read a whole ton for this class, but the pieces she picked out were good reads, and I really did enjoy the class discussions over them. There are quizzes every week over the readings, and she genuinely enjoys having us talk. Admittedly, some days were a little boring, but I would definitely take her again for another class.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTMyOTI4ODk1","clarity_rating":5,"student_grade":"","is_for_credit":true,"attendance_status":"N","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Skip class? You won't pass.--Clear grading criteria","textbook_use":5,"would_take_again":true}]