[{"class":"MUSI2222","date_posted":"2011-07-26 11:13:39 +0000 UTC","comment":"Excellent teacher, in every class that I have had with her.  I have taken her theory and aural skills courses, and a few small ensemble classes; she is to the point, direct, and always helpful within reason.  Be prepared to work, and follow her instruction; you can't go wrong.  Great teacher, would take any of her classes again","difficulty_rating":3,"teacher_id":"UmF0aW5nLTE4ODUxNDA0","clarity_rating":4,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true},{"class":"MUSI1107","date_posted":"2008-12-06 00:00:17 +0000 UTC","comment":"As a person, I really liked her. Very cute with a soothing voice. Going into exams, I always felt like I knew what I was doing. But I never did! REALLY MEMORIZE LISTENING GUIDES, and you'll do fine. If you can't, you won't do well. I'm a composer, (amateur, of course) and I got a B in this class. I expected more, and I'm so disappointed.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTE1MTE4MjUz","clarity_rating":3,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":2,"would_take_again":true},{"class":"MUSI1112","date_posted":"2007-04-27 23:54:59 +0000 UTC","comment":"I had Allyson for Music Theory and Aural Skills. There were many times, especially at the beginning where I felt like giving up because I was going to fail but she will help you and gives room for improvment! Some might not like her if you like rules, and lots of structure, but i liked her laid back attitude which helped me to enjoy her classes!","difficulty_rating":3,"teacher_id":"UmF0aW5nLTEzMDc1NTU4","clarity_rating":5,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true}]