[{"class":"HON3000","date_posted":"2019-05-09 15:16:21 +0000 UTC","comment":"Great teacher. Gives good feedback on papers. I just wasn't comfortable with the class material or discussions. I am a bit shy, and I always make sure everyone is done speaking before I speak. However, either someone would say what I was going to say, or discussion would end before I could get myself to say anything. That's more on me than her .","difficulty_rating":2,"teacher_id":"UmF0aW5nLTMxODIzOTkw","clarity_rating":5,"student_grade":"A","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Gives good feedback--Get ready to read--Participation matters","textbook_use":5,"would_take_again":false},{"class":"MUSI1111","date_posted":"2019-01-11 16:09:37 +0000 UTC","comment":"DO NOT TAKE THIS PROFESSOR. She is the toughest grader and does not believe in extra credit. She takes off points for the most ridiculous things and is not considerate that many students are new to aural skills, especially with it being a level one course. She does not forgive tardies or absences, no matter the situation. Will never take her again","difficulty_rating":4,"teacher_id":"UmF0aW5nLTMxMjQ0MDU1","clarity_rating":1,"student_grade":"C","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Tough Grader--Participation matters--Skip class? You won't pass.","textbook_use":5,"would_take_again":false},{"class":"MUSI111","date_posted":"2018-12-03 21:03:44 +0000 UTC","comment":"Professor Kerney is mediocre. However, she grades very harshly, especially on sight singing exams and homework. This is about a learning experience! I have heard there are better Aural Skills profs. on campus that grade more fairly, yet still make you work! You won't fail but you may not get an A -- strict attendance policy. No email responce!","difficulty_rating":3,"teacher_id":"UmF0aW5nLTMwODUxODI0","clarity_rating":2,"student_grade":"B-","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Tough Grader--Participation matters--Skip class? You won't pass.","textbook_use":5,"would_take_again":false}]