[{"class":"ENGR2214","date_posted":"2014-01-22 18:24:30 +0000 UTC","comment":"Professor Harcrow is a very nice guy, but the worst teacher I've ever had. I'm here to warn anyone not to take a course with him. He is never prepared for lectures and attending class is pointless because he simply reads the slides provided from the publisher. I took him for Statics and received an \"A\" and still wouldn't recommend him to anyone.","difficulty_rating":4,"teacher_id":"UmF0aW5nLTIyNzgyNzg2","clarity_rating":1,"student_grade":"A","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true},{"class":"ENGR3122","date_posted":"2013-06-22 21:18:04 +0000 UTC","comment":"Not prepared, doesn't know material and gives crazy hard tests. He cannot answer your questions unless the solutions manual has the answer and if you work a problem differently from the soln manual (and still get the right answer), he will mark it wrong because he has no concept of dynamics. Don't expect to learn unless you teach yourself.","difficulty_rating":5,"teacher_id":"UmF0aW5nLTIxOTE1NjU5","clarity_rating":1,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":1,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true},{"class":"ENGR3122","date_posted":"2013-05-10 15:16:15 +0000 UTC","comment":"BAD Instr! He relies on the Sol. Manual. If he were given his own tests in the time frame given to take the test, he'd fail his own class. DONT TAKE HIM!!! You will be frustrated and mad because the guy is laughs at his own jokes and He CAN'T TEACH! If you ask him how to solve something from the book he hasn't worked HE WONT! Because HE CAN'T!!!","difficulty_rating":4,"teacher_id":"UmF0aW5nLTIxNzI5NzM1","clarity_rating":1,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true}]