[{"class":"2010","date_posted":"2025-04-21 15:50:25 +0000 UTC","comment":"Eh. He's kinda rude when you slightly step out of line but for the most part he is easy to work with and it's easy to pass this class as long as you pay attention and study. It's a lot of quizzes and tests, lockdown, and attendance is mandatory, but if it is needed to take this class, it is very possible to do. 3 short written essays, easily graded","difficulty_rating":2,"teacher_id":"UmF0aW5nLTQwOTkxMTMy","clarity_rating":4,"student_grade":"A+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Clear grading criteria--Lecture heavy","textbook_use":-1,"would_take_again":true},{"class":"86445","date_posted":"2024-12-13 19:29:16 +0000 UTC","comment":" Not a very hard class if you pay attention to his lectures and take notes. There is usually a short quiz every week that is easy if you do the reading. 3 short written exams are given and they all are done during class. Overall a very good and funny professor who knows what he is talking about and can connect concepts very well.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTQwMjc5NDcw","clarity_rating":4,"student_grade":"A+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Lecture heavy--Graded by few things","textbook_use":-1,"would_take_again":true},{"class":"ENGL1102","date_posted":"2024-12-03 22:46:30 +0000 UTC","comment":"Took the class online and attendance was just acknowledging you know you have work due that week. Occasional assignments outside of the major assignment of writing a single research paper. As long as you budget your time well you will do fine. He also actually reads your stuff and gives good feedback.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTQwMDg3OTM0","clarity_rating":5,"student_grade":"A+","is_for_credit":true,"attendance_status":"mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Clear grading criteria--Gives good feedback","textbook_use":3,"would_take_again":true},{"class":"86445","date_posted":"2024-12-02 18:59:53 +0000 UTC","comment":"a very lecture heavy \"read off the PowerPoint\" class, but not extremely difficult if you show up and take some notes. all slides are posted online and there is an easy 4 question quiz every week. 4 written exams over the course that are also fairly easy if you kind of know what's going on. very funny and understanding professor. DO NOT MISS CLASS. ","difficulty_rating":3,"teacher_id":"UmF0aW5nLTQwMDY2OTIy","clarity_rating":4,"student_grade":"B+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Hilarious--Lecture heavy","textbook_use":-1,"would_take_again":true},{"class":"86445","date_posted":"2024-11-22 03:50:53 +0000 UTC","comment":"quizzes every week with three in person short essay tests. he grades these pretty tough, but quizzes are very manageable. however, his lectures are often confusing and did not help much with understanding the concepts. he takes attendance which is important for your grade. gives a review and open discussion before any quiz/test. ","difficulty_rating":2,"teacher_id":"UmF0aW5nLTQwMDExMDIw","clarity_rating":3,"student_grade":"Not sure yet","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Tough grader--Lecture heavy","textbook_use":-1,"would_take_again":true}]