[{"class":"TPS1107","date_posted":"2017-05-06 23:52:57 +0000 UTC","comment":"I felt like there was a lot of random assignments that were just really unnecessary and annoying. That is kind of how the whole class felt though... Certainly wasn't my thing but I had to take it. Other than that she was a fine professor although I feel like she doesn't give out 100's very easily on your assignments.","difficulty_rating":4,"teacher_id":"UmF0aW5nLTI4MjM1NTE1","clarity_rating":3,"student_grade":"B","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":1,"comment_dislikes":0,"rating_tags":"LOTS OF HOMEWORK--GRADED BY FEW THINGS--EXTRA CREDIT","textbook_use":0,"would_take_again":true},{"class":"TPS1107","date_posted":"2017-04-15 11:04:07 +0000 UTC","comment":"Not a hard class. It requires you to buy 2 books that you must read to do well on the online quizzes (she provides other passages). The midterm, can be challenging if you don't study enough. The group final/play was probably the best part of the class. Show up & do your part. Think of your english teacher when writing the mandatory play responses.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTI4MDU0MDkw","clarity_rating":5,"student_grade":"B+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":1,"comment_dislikes":0,"rating_tags":"Tough Grader--Gives good feedback--Get ready to read","textbook_use":5,"would_take_again":true},{"class":"TPS1107","date_posted":"2017-02-07 01:15:42 +0000 UTC","comment":"DO NOT MISS ANY PLAYS. I missed one because the tickets sold out two weeks before and she was not sympathetic at all. Gave me a zero and it dropped my grade into the 50s. Spent the rest of the semester catching up and barely stretched into a B. If you are a business major like me trying to get an arts credit don't bother. NOT AN EASY A.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTI3ODA5NjAx","clarity_rating":3,"student_grade":"B-","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"GROUP PROJECTS","textbook_use":0,"would_take_again":false},{"class":"TPS1107","date_posted":"2016-11-26 17:07:24 +0000 UTC","comment":"Final project is a group project play. There are a lot of lectures every day. Don't be late, she doesn't like that. I wouldn't take this class again because it consumes a lot of your time, if you need a fine arts credit I've heard it is better to take music online if you can! She is very passionate about the class and theater.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTI3MjU2MjYy","clarity_rating":2,"student_grade":"A","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Skip class? You won't pass.--GROUP PROJECTS--LECTURE HEAVY","textbook_use":5,"would_take_again":false},{"class":"TPS1107","date_posted":"2016-11-09 17:22:24 +0000 UTC","comment":"Prof Joyce is a really nice person who cares about her students. The class isn't hard at all! it consist of about 5 quiz online, a midterm and a final which is an 8 person play that last 5 mins. Take her if you want to have fun but make a good grade!","difficulty_rating":2,"teacher_id":"UmF0aW5nLTI3MTU4MTEz","clarity_rating":4,"student_grade":"B+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Hilarious--Amazing lectures--Caring","textbook_use":0,"would_take_again":true},{"class":"TPS1107","date_posted":"2016-11-04 08:48:56 +0000 UTC","comment":"If you are a theatre major, GO FOR IT. She treats us as if we are all theatre majors. She asks questions on the midterm about stage directions she never teaches. You have to read tons of scripts, and her tests are crazy hard. She takes attendance. The syllabus is really detailed, and there is extra credit, though.","difficulty_rating":4,"teacher_id":"UmF0aW5nLTI3MTI5MDA5","clarity_rating":1,"student_grade":"","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Tough Grader--Get ready to read--GROUP PROJECTS","textbook_use":5,"would_take_again":false},{"class":"TPS1107","date_posted":"2016-11-03 02:25:35 +0000 UTC","comment":"I would NOT recommend taking this class. I know a lot of people need a fine arts credit, so whatever you do make sure to sign up for a different class. This was the worst class I've ever taken. She would treat us like we were theater majors, and most of us were only taking the class cause it was mandatory. I will say that the syllabus she goes over at the beginning of the semester is a HUGE help. If you're ever unsure what is due or what you're doing in class that day, look at the syllabus. I'm warning you though, your final exam is you with seven other people in a group getting up in front of the class and acting out a play you and your group wrote. At the beginning of the semester she makes you do a lot of group activities and I thought it wasn't necessary because we are in college,  not middle school. I hated this class and I never thought it would be one of my toughest classes. Make sure to take something else.","difficulty_rating":4,"teacher_id":"UmF0aW5nLTI3MTIwNzQ2","clarity_rating":1,"student_grade":"","is_for_credit":true,"attendance_status":"Y","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Participation matters--GROUP PROJECTS--Skip class? You won't pass.","textbook_use":0,"would_take_again":false},{"class":"TPS1107","date_posted":"2015-05-19 22:43:22 +0000 UTC","comment":"She takes this class too seriously when the majority of the students are taking it bc its required for Gen Ed. The class is unbelievably easy especially with the extra credit, just make sure you don't half butt assignments and it will be so easy. WARNING: the final is a play","difficulty_rating":1,"teacher_id":"UmF0aW5nLTI0ODcxNjM0","clarity_rating":2,"student_grade":"A+","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":2,"comment_dislikes":0,"rating_tags":"","textbook_use":2,"would_take_again":true},{"class":"TPS1107","date_posted":"2015-02-12 11:29:27 +0000 UTC","comment":"Her expectations are NEVER laid out clearly ahead of time. A one paragraph response to a monologue video in class was graded very strictly and I got an 80 on it.. There were no guidelines ahead of time. She also closes the doors at the exact time of the class... Which is a problem if you're walking from a building way across campus. ","difficulty_rating":4,"teacher_id":"UmF0aW5nLTI0MzgwMTc1","clarity_rating":2,"student_grade":"","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true},{"class":"83401","date_posted":"2015-01-17 15:07:33 +0000 UTC","comment":"Joyce was TOO passionate about a TPS class. Several quizzes on the txtbk. Answers are word for word fill in the blanks so READ & HIGHLIGHT. Tests are super hard so study up! Better make friends the 1st 1-2 days bc on the 3rd day she WILL make you choose (ALL SEM.) group partners of 8 people. Don't work with people you're not comfortable with! ","difficulty_rating":2,"teacher_id":"UmF0aW5nLTI0MzAwODgx","clarity_rating":2,"student_grade":"","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":1,"comment_dislikes":0,"rating_tags":"","textbook_use":4,"would_take_again":true},{"class":"1107","date_posted":"2015-01-14 16:54:43 +0000 UTC","comment":"If you take the quizzes, put effort into the required play responses and your contribution to the group project final, you should get an A. I have no experience in anything theatre related but she was clear in what was needed. She has random assignments done in class that you can't make up if you miss, unless it's excused.","difficulty_rating":1,"teacher_id":"UmF0aW5nLTI0Mjg3OTMw","clarity_rating":4,"student_grade":"","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":4,"would_take_again":true},{"class":"THEAT1107","date_posted":"2014-12-17 22:35:55 +0000 UTC","comment":"It is her rules or the HWY. Basically, do everything she has down on the syllabus, do well on the quizzes, and do NOT miss group days, then you have an easy A.  I personally did not like her teaching style, she is rash, demanding and makes no effort to work with students.  On the flip side, the syllabus is the bible -follow it you will be fine.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTI0MTI2NDcz","clarity_rating":3,"student_grade":"B","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true},{"class":"1107","date_posted":"2014-12-10 14:43:11 +0000 UTC","comment":"FINAL EXAM IS AN 8 PERSON PLAY! You've been warned. shes an alright teacher, kind of trails off and doesnt always seem she knows a lot. She's clearly experienced just not the best at expressing it. You must like group projects and ice breakers, not sure if department wide, but there are many acting exercises. A lot of extra credit opportunities.","difficulty_rating":1,"teacher_id":"UmF0aW5nLTI0MDE4NTM2","clarity_rating":3,"student_grade":"","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true},{"class":"1107","date_posted":"2014-12-05 23:37:56 +0000 UTC","comment":"She is a nice woman, she knows what she's talking about and really cares about the students. The class is pretty self-explanatory and simple. No phones or laptops in class, and she closes and locks the door five minutes after class starts so you better be on time.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTIzOTY1OTc1","clarity_rating":5,"student_grade":"","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":2,"would_take_again":true}]