[{"class":"TPS4833","date_posted":"2022-01-09 02:20:11 +0000 UTC","comment":"Take ANY class with her, and you will regret it. She is disrespectfully petty in her feedback and she will crush any desire you have to pursue design in any capacity. She created a toxic environment that made me dread attending her class and the workload was ridiculous with new projects each class. Hands down, the worst teacher I've ever had.","difficulty_rating":5,"teacher_id":"UmF0aW5nLTM1NzIxNzg2","clarity_rating":1,"student_grade":"","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Lots of homework--Skip class? You won't pass.--Tough grader","textbook_use":0,"would_take_again":false},{"class":"TPS4833","date_posted":"2022-01-01 20:36:00 +0000 UTC","comment":"In general, dont sign up for a design class for an easy A, but especially under Jack, you wont get any constructive criticism or grace. She grades based on her aesthetic not how much you have improved in the class. There is no empathy, and she makes fun of her students. According to her actions, no emergency is worth missing her class for.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTM1Njg0MjM0","clarity_rating":1,"student_grade":"A","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Lots of homework--Participation matters--Skip class? You won't pass.","textbook_use":0,"would_take_again":false},{"class":"TPS4833","date_posted":"2021-12-22 04:01:23 +0000 UTC","comment":"To get an A and do well in an already intensive theatre degree program, I did many all-nighters (did not sleep until it was time to leave for class). She barely spends any time on the basics and then grades tough on more complex things later. All we did was present our homework. Passive-aggressive, name drops, only knows about opera and hats.","difficulty_rating":5,"teacher_id":"UmF0aW5nLTM1NjI4NDUw","clarity_rating":2,"student_grade":"A","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Lots of homework--Skip class? You won't pass.--Tough grader","textbook_use":0,"would_take_again":false}]