[{"class":"PSYC1101","date_posted":"2025-07-10 17:34:36 +0000 UTC","comment":"The entire course was graded and based solely upon the online textbook. To succeed, get familiar with the textbook as the basis of grading is on how well you understand the textbooks presentation rather than the material itself. The tests sometimes asked inconspicuous statistics mentioned only once in the textbook; be prepared to miss a few points","difficulty_rating":3,"teacher_id":"UmF0aW5nLTQxNDkzODI2","clarity_rating":4,"student_grade":"A+","is_for_credit":true,"attendance_status":"","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Clear grading criteria","textbook_use":3,"would_take_again":true},{"class":"PSYC2500","date_posted":"2024-05-13 18:28:09 +0000 UTC","comment":"I am an A/B student. I regret taking this course. He gives a lot of busy work without explaining anything, doesnt teach. This is a self taught class with no clear direction on the material he wants you to learn and will test on. test are lock down browsers. He tries everything to make you fail. Avoid this class if you want to keep your gpa high.","difficulty_rating":5,"teacher_id":"UmF0aW5nLTM5NDUxMzg0","clarity_rating":1,"student_grade":"C+","is_for_credit":false,"attendance_status":"mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true},{"class":"PSYC2500","date_posted":"2024-04-18 18:08:56 +0000 UTC","comment":"I am in his online class. I think he could post more lectures. He is great at responding to emails, and is very detailed. This class really was inconvenient with how the outside platform ran things. we also had to write a paper on top of all the quizzes and homework. Very time consuming class. he also made his own separate lockdown tests. online :/","difficulty_rating":4,"teacher_id":"UmF0aW5nLTM5MTMzMTM4","clarity_rating":4,"student_grade":"Not sure yet","is_for_credit":true,"attendance_status":"non mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Gives good feedback--Lots of homework","textbook_use":3,"would_take_again":true},{"class":"PSYC2500","date_posted":"2024-01-01 02:28:50 +0000 UTC","comment":"Professor Sarris really cares about how you do on quizzes and assignments. He was extremely helpful with his feedback on assignments and when I would email him questions, he always gave detailed answers. You will have a weekly quiz on lockdown and plenty of assignments to earn points. It is not an easy class but Professor Sarris is very helpful.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTM4ODE1NTIw","clarity_rating":5,"student_grade":"A","is_for_credit":true,"attendance_status":"non mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Gives good feedback--Caring--Accessible outside class","textbook_use":3,"would_take_again":true},{"class":"PSYC2500","date_posted":"2023-12-11 18:13:46 +0000 UTC","comment":"Prof. Sarris was very nice to learn under. Everything was clearly defined on what he wanted and he gave pretty good feedback. EVERYTHING is on lockdown, so be prepared to read & study A LOT. He uses InQuizitive, which was very frustrating to me. One Lit Review is worth most of your grade, but it's broken up into multiple parts, which can help. ","difficulty_rating":3,"teacher_id":"UmF0aW5nLTM3ODQ4MDYy","clarity_rating":3,"student_grade":"B+","is_for_credit":true,"attendance_status":"non mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--Clear grading criteria--Gives good feedback","textbook_use":3,"would_take_again":true}]