[{"class":"CRJU1101","date_posted":"2019-03-15 01:50:08 +0000 UTC","comment":"I absolutely hated this class. The professor does not know how to lecture. Honestly, if she didn't have an attendance policy I wouldn't show up. She expects you to teach yourself the material. There are 5 quizzes which are tough because she doesn't tell you what's on them. There is also a midterm and final which come from the quizzes. DON'T TAKE!!","difficulty_rating":1,"teacher_id":"UmF0aW5nLTMxNDM5MDg1","clarity_rating":2,"student_grade":"A+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":1,"rating_tags":"Get ready to read--Participation matters--Skip class? You won't pass.","textbook_use":5,"would_take_again":false},{"class":"CJ1101","date_posted":"2018-07-25 10:51:22 +0000 UTC","comment":"Dr. Crank, I felt like she was pretty fair and clear as what she wanted from you as a student. I took her for CJ 1101 in the summer. It was a lot of work due to the time frame but overall she gave you plenty of time to complete all work for the week. An A is very possible, if you follow her syllabus! I would take her again.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTMwMzcxNTg5","clarity_rating":4,"student_grade":"","is_for_credit":true,"attendance_status":"mandatory","is_online":true,"comment_likes":1,"comment_dislikes":0,"rating_tags":"Gives good feedback--Get ready to read--Clear grading criteria","textbook_use":5,"would_take_again":true},{"class":"CRJU3301","date_posted":"2018-05-08 12:41:58 +0000 UTC","comment":"Really enjoyed her Research Methods class. The class itself is not easy, but she does try her best to make it bearable. She is very nice if she sees that you put in the effort to pass the class, however will not be lenient if you slack off and skip often. Overall, if you do your work, pay attention, and come to class you shouldn't have any problems","difficulty_rating":2,"teacher_id":"UmF0aW5nLTMwMDIzNjUx","clarity_rating":4,"student_grade":"A+","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Skip class? You won't pass.--ACCESSIBLE OUTSIDE CLASS","textbook_use":0,"would_take_again":true},{"class":"CRJU3301","date_posted":"2017-06-08 07:59:28 +0000 UTC","comment":"Professor Crank is a knowledgable woman but if you're looking for an easy class this isn't it. She's terribly difficult, A LOT of busy work, and very harsh grader. You have to work hard just to receive a C in her class. She thinks this is grad school and that everyone is at her level of experience. Not recommended","difficulty_rating":5,"teacher_id":"UmF0aW5nLTI4NDM0MzQ3","clarity_rating":2,"student_grade":"","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":2,"comment_dislikes":0,"rating_tags":"Tough Grader--Get ready to read--LOTS OF HOMEWORK","textbook_use":5,"would_take_again":false},{"class":"CRJU3301","date_posted":"2017-05-10 01:50:44 +0000 UTC","comment":"I took her for research method. The class itself wasn't easy but she is a great professor. Very knowledgeable. She drops the lowest quiz grade and gives some extra credits. If you need help, just ask her. She will help you. Fix whatever she  tells you to fix on literature review and the assignments then you will do fine on the paper.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTI4MjY5MTE2","clarity_rating":5,"student_grade":"","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":1,"comment_dislikes":1,"rating_tags":"Gives good feedback--Respected--Skip class? You won't pass.","textbook_use":5,"would_take_again":true}]