[{"class":"CRJU1101","date_posted":"2016-12-15 17:07:30 +0000 UTC","comment":"His class was very lecture heavy because he read from powerpoint every class period. All the quizzes were online but you have to read the chapters to do well on them. There were only quizzes and a final and the final was 100 questions in class. He gave the final topics beforehand so just know the topics and you'll be fine. Overall, the class was ok","difficulty_rating":4,"teacher_id":"UmF0aW5nLTI3NTE2Mjk2","clarity_rating":3,"student_grade":"A","is_for_credit":true,"attendance_status":"non mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--GRADED BY FEW THINGS--LECTURE HEAVY","textbook_use":5,"would_take_again":false},{"class":"CJ3315","date_posted":"2015-03-18 22:04:27 +0000 UTC","comment":"The class is interesting but he is a very tough grader. Make sure your case briefs are perfect or you will receive a failing grade. Also, you will not get your grades back for a few weeks. There is a sign in sheet every class. Online quizzes, case briefs, midterm, final, and participation. If you have the option of another prof, take it!","difficulty_rating":5,"teacher_id":"UmF0aW5nLTI0NDc1NDE5","clarity_rating":1,"student_grade":"","is_for_credit":true,"attendance_status":"","is_online":false,"comment_likes":1,"comment_dislikes":0,"rating_tags":"","textbook_use":1,"would_take_again":true},{"class":"CRJU3300","date_posted":"2014-04-19 13:13:43 +0000 UTC","comment":"I did not like this professor. Class had 5 online quizzes, midterm, and final. Material on each was always out of left field, and always way too much and unclear. Questions had more than one right answer and tests were too long to finish in allotted time period. Midterm was ridiculous.","difficulty_rating":5,"teacher_id":"UmF0aW5nLTIzMDYzMjE0","clarity_rating":3,"student_grade":"B+","is_for_credit":false,"attendance_status":"N","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true}]