[{"class":"SPAN1002","date_posted":"2014-05-25 10:59:11 +0000 UTC","comment":"The class was mostly what you'd expect from a Spanish class! She gives a lot of homework but it's not a significant portion of the final grade and I actually found it kinda helpful. She tells you exactly what to expect from the test and if you have questions she's more than happy to answer them. If you study and attend class you'll do fine!","difficulty_rating":2,"teacher_id":"UmF0aW5nLTIzMzEwNjYy","clarity_rating":4,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true},{"class":"SPAN1002","date_posted":"2014-05-06 18:22:18 +0000 UTC","comment":"She knows what she is talking about and I do enjoy her teaching style. She is a teacher that makes you work for your grade!  My only issues with her is the amount of hw she gave us. Sometimes I felt that she did not realize that we have other classes. She tells you exactly what to expect on each test, so there are no real surprises!","difficulty_rating":2,"teacher_id":"UmF0aW5nLTIzMTc5NTc4","clarity_rating":4,"student_grade":"A-","is_for_credit":false,"attendance_status":"Y","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true},{"class":"SPAN2001","date_posted":"2014-05-06 00:12:38 +0000 UTC","comment":"Avoid this woman plz. Shes not a bad person or anything she is just so picky with her grading! She will count you late if you are not in there the minute class starts. Ive always had A's in spanish until i got her as a professor,that says a lot to me! She doesn't speak in spanish without explaining it in english. Which doesn't help me outside class","difficulty_rating":4,"teacher_id":"UmF0aW5nLTIzMTcyNzk4","clarity_rating":2,"student_grade":"","is_for_credit":false,"attendance_status":"","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true},{"class":"SPAN2001","date_posted":"2014-04-22 19:29:42 +0000 UTC","comment":"Easy on grading and makes things easy to understand. But there were A few times, she assigned assignments for homework before going over the subjects in class. Her syllabus was not clear on what to study before class, she gave a project the week before it was due, a group project at that. She was not a hard teacher though. I still recommend her.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTIzMDc5MTE0","clarity_rating":2,"student_grade":"B+","is_for_credit":false,"attendance_status":"Y","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true},{"class":"SPAN1102","date_posted":"2013-12-05 23:49:32 +0000 UTC","comment":"This is her first semester at KSU so no real guides. She is a decent teacher and does a good job of getting point across. My only problem was that she barley ever spoke in spanish unless she was giving an example. then she would turn around and give us a listening on tests. The only real speaking we've had was the speaking portion of our final.","difficulty_rating":2,"teacher_id":"UmF0aW5nLTIyNDUwNTk4","clarity_rating":4,"student_grade":"B+","is_for_credit":false,"attendance_status":"Y","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true}]