[{"class":"1102","date_posted":"2025-05-07 12:33:03 +0000 UTC","comment":"She suspected me of cheating even though I wasn't which ultimately led me to fail the class on my last assignment. So that's no fun. Also a lot of assignments and strict on due dates. This is an online class I work 2 jobs and I'm newly married. I do online to be able to manage my schooling without having to do too much my 0/10 do not recommended. ","difficulty_rating":4,"teacher_id":"UmF0aW5nLTQxMTkxNzAw","clarity_rating":1,"student_grade":"D+","is_for_credit":true,"attendance_status":"non mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Tough grader--Get ready to read--Lots of homework","textbook_use":3,"would_take_again":true},{"class":"1102","date_posted":"2024-12-14 19:58:33 +0000 UTC","comment":"There is a lot of writing for her class, but the guidelines are pretty clear and they are all for discussion posts. There is also a lot of reading, and the textbook can be confusing at times. But there is also a clear routine for each week, which makes planning and executing the work easy. There is also 3 extra credit assignments you can do.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTQwMjk3ODk1","clarity_rating":4,"student_grade":"A","is_for_credit":true,"attendance_status":"non mandatory","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Get ready to read--EXTRA CREDIT--Gives good feedback","textbook_use":3,"would_take_again":true},{"class":"3500","date_posted":"2023-05-06 13:51:14 +0000 UTC","comment":"She has been the worst professor I've had so far in college. She constantly changes dates and criteria within her assignments. There are no clear criteria for what she wants. The class is poorly structured. Don't expect her to help you she will just criticize you for not being able to figure it out on your own. ","difficulty_rating":5,"teacher_id":"UmF0aW5nLTM3ODQxNTIz","clarity_rating":1,"student_grade":"C","is_for_credit":false,"attendance_status":"mandatory","is_online":true,"comment_likes":1,"comment_dislikes":0,"rating_tags":"","textbook_use":3,"would_take_again":true}]