[{"class":"ACCT2102","date_posted":"2021-05-10 18:46:09 +0000 UTC","comment":"Bowen was fantastic! A lot of stuff almost every week. Other than the tests, almost everything else was &quot;free points&quot; just open book stuff to complete that gave you a nice boost. 3 tests, worth a total of 60% of your grade. All quizzes were only worth a total of 3.5% of your grade and could have notes. Just study and you will pass the tests!","difficulty_rating":3,"teacher_id":"UmF0aW5nLTM0NzU0OTAw","clarity_rating":5,"student_grade":"A","is_for_credit":true,"attendance_status":"","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Lots of homework--Get ready to read--EXTRA CREDIT","textbook_use":5,"would_take_again":true},{"class":"ACCT2102","date_posted":"2021-05-09 23:50:47 +0000 UTC","comment":"His class is set up with minimal busy work but ample opportunity to help your grade if you do poorly on an exam. I got a 60 on the first one and scraped a 90 in the class after realizing how to study and prepare better for the exam. He doesn't ask for much each week but I feel much more knowledgeable about this class than fin acct.","difficulty_rating":3,"teacher_id":"UmF0aW5nLTM0NzQ4Mzg2","clarity_rating":5,"student_grade":"A","is_for_credit":true,"attendance_status":"","is_online":true,"comment_likes":0,"comment_dislikes":0,"rating_tags":"Clear grading criteria--EXTRA CREDIT","textbook_use":5,"would_take_again":true},{"class":"ACCT2102","date_posted":"2021-01-25 23:07:19 +0000 UTC","comment":"This semester has just barley started but I think I can go ahead and safely give professor Bowen this rating. Compared to my other accounting classes, I have already learned just as much as I did throughout the whole semester. Professor Bowen makes things really easy to understand and gives real world examples to further help the students' learning","difficulty_rating":2,"teacher_id":"UmF0aW5nLTM0MzE1MTE1","clarity_rating":5,"student_grade":"","is_for_credit":true,"attendance_status":"mandatory","is_online":false,"comment_likes":0,"comment_dislikes":0,"rating_tags":"","textbook_use":5,"would_take_again":true}]